<div class="wrapper">
    <h1>Основы РНР</h1>
    <main>
        <p>
            РНР (Hypertext PreProcessor) - исторически технология, расширяющая
            возможности HTML "вставками" кода.
            Обнаруживая тег &lt;?php ?> сервер, прорабатывающий страницу,
            переходит в программный режим, создавая возможность условных,
            циклических конструкций, а также использования переменных и 
            функций.
        </p>
        <p>
            РНР язык процедурный, хотя и поддерживает ООП. Пространств
            имен изначально не было, поэтому для разделения имен функций
            и переменных было принято начинать все переменные с знака "$".
            Типизация динамическая, читающая (аналогично JS), но не 
            объектная.
        </p>
    </main>
</div>